tests/stress/db/hey_get_local.txt

Summary:
  Total:	108.6462 secs
  Slowest:	9.6826 secs
  Fastest:	0.0003 secs
  Average:	0.1727 secs
  Requests/sec:	9204.1916
  

Response time histogram:
  0.000 [1]	|
  0.969 [998971]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.937 [0]	|
  2.905 [1]	|
  3.873 [0]	|
  4.841 [0]	|
  5.810 [0]	|
  6.778 [1]	|
  7.746 [0]	|
  8.714 [0]	|
  9.683 [1]	|


Latency distribution:
  10% in 0.0655 secs
  25% in 0.1140 secs
  50% in 0.1710 secs
  75% in 0.2179 secs
  90% in 0.2764 secs
  95% in 0.3200 secs
  99% in 0.4128 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0003 secs, 9.6826 secs
  DNS-lookup:	0.0105 secs, 0.0000 secs, 0.3902 secs
  req write:	0.0040 secs, 0.0000 secs, 0.4912 secs
  resp wait:	0.0544 secs, 0.0001 secs, 9.5354 secs
  resp read:	0.0429 secs, 0.0000 secs, 0.5974 secs

Status code distribution:
  [200]	998975 responses

Error distribution:
  [1025]	Get "http://localhost:5500/users": context deadline exceeded (Client.Timeout exceeded while awaiting headers)